---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeConstructionMethod
source: html/f638b1ae-e7f4-a606-543a-f92302970ef5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeConstructionMethod Property

"Construction Method":

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeConstructionMethod { get; }
```